Documents/ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Замена</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаявкаНаДоставку</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКВыплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусУтвержденияПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУтвержденияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелательнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУтвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииРКО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииСРС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеСРасчетногоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовПоНачислению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаРасходованиеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	ОтображатьПериодРегистрации = Константы.ОтражатьДвиженияПоРасчетуСПерсоналомПоПериодуРегистрации.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда		
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	Элементы.Статья.АвтоОтметкаНезаполненного = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
		//КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
		ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	Иначе
		//Элементы.КонтрагентДополнительно.Видимость = Ложь;
		Элементы.ПоказатьДополнительнуюИнформацию.Видимость = Ложь;
	КонецЕсли;
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СостояниеОплачено = Объект.Проведен И РегистрыНакопления.ДенежныеСредстваКВыплате.ОпределитьСостояниеОплаты(Объект.Ссылка);
	ПравоУтверждения = РольДоступна("УтверждениеЗаявокНаРасходованиеДенежныхСредств")
					   ИЛИ РольДоступна("ПолныеПрава")
					   ИЛИ РольДоступна("АдминистраторСистемы");
	УстановитьСписокСтатусов();
	УстановитьДоступностьЭлементовПоСтатусу();	
	УстановитьВидимостьЭлементовПоТипуДС();
	УстановитьВидимостьЭлементовПоВидуРКО();
	УстановитьВидимостьЭлементовПоВидуСРС();
	УстановитьВидимостьЭлементовПоНДС();
	
	УправлениеПоказателямиПлатежаВБюджет();
	
	ФинансыСервер.ЗаполнитьСписокКодовВидаДохода(Элементы.КодВидаДохода, Объект.ВидОперацииСРС);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.РаспределениеПлатежа.Количество() > 0 Тогда
		Если Объект.РаспределениеПлатежа.Итог("Сумма") > Объект.СуммаДокумента Тогда
			ТекстОшибки = "Сумма распределения превышает сумму документа";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийОбъект, "РаспределениеПлатежа", , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) 
			И Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
			ТекстОшибки = "Не заполнен сотрудник (подотчетное лицо)";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийОбъект, "Контрагент", , Отказ);
			Возврат;
		КонецЕсли;
			
		Если Объект.ВидОперацииРКО <> Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику 
			И Объект.РаспределениеПлатежа.Количество() > 0 Тогда
			Объект.РаспределениеПлатежа.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда	
		Если Объект.Счет.Пустая() Тогда
			ТекстОшибки = "Не заполнен банковский счет организации";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийОбъект, "Касса", , Отказ);
			Возврат;
		КонецЕсли;
			
		Если Объект.ВидОперацииСРС <> Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику 
			И Объект.РаспределениеПлатежа.Количество() > 0 Тогда
			Объект.РаспределениеПлатежа.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	//++ №7928 проверка сумм по виду операции "Зарплата сотрудникам"
	ФинансыСервер.ПроверитьСуммуЗарплатыСотрудникамПоСуммеДокумента(Объект, Отказ, ПараметрыЗаписи.РежимЗаписи);
	//-- №7928	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации 		= НачалоМесяца(ВыбранноеЗначение);
		ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
		Модифицированность = Истина;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами" Тогда
		
		ПолучитьРаспределениеПлатежаИзХранилища(ВыбранноеЗначение.АдресПлатежейВХранилище);
	
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект, "ВалютаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.Договор = Объект.Контрагент.ОсновнойДоговор;
		//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
		//КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
		ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	Иначе
		//Элементы.КонтрагентДополнительно.Видимость = Ложь;
		Элементы.ПоказатьДополнительнуюИнформацию.Видимость = Ложь;
	КонецЕсли;
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииНаСервере()
	Если НЕ Объект.Касса.Валюта.Пустая() Тогда
		Объект.ВалютаДокумента = Объект.Касса.Валюта;
	Иначе
		Объект.ВалютаДокумента = Константы.ВалютаУчета.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	КассаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииРКОПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	//ОбновитьДанные();
	ВидОперацииРКОПриИзмененииНаСервере();
	УстановитьВидимостьЭлементовПоВидуРКО();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииРКОПриИзмененииНаСервере()
	Если НЕ Объект.ВидОперацииРКО.Пустая() Тогда
    	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперацииРКО, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииСРСПриИзменении(Элемент)
	
	// #14544 на случай если включат данную настройку, чтобы в документе был корректный период = дате документа
	Если НЕ ОтображатьПериодРегистрации И ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	//ОбновитьДанные();
	ВидОперацииСРСПриИзмененииНаСервере();
	УстановитьВидимостьЭлементовПоВидуСРС();
	УстановитьВидимостьЭлементовПоНДС();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииСРСПриИзмененииНаСервере()
	Если НЕ Объект.ВидОперацииСРС.Пустая() Тогда
    	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперацииСРС, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
	КонецЕсли;
	ФинансыСервер.ЗаполнитьСписокКодовВидаДохода(Элементы.КодВидаДохода, Объект.ВидОперацииСРС);
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику
		И Объект.КодВидаДохода = "" Тогда
		Объект.КодВидаДохода = "1";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусУтвержденияПлатежаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуДС();
	УстановитьВидимостьЭлементовПоВидуРКО();
	УстановитьВидимостьЭлементовПоВидуСРС();
	УправлениеПоказателямиПлатежаВБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПоНДС();
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Если Объект.РаспределениеПлатежа.Количество() = 1 Тогда
		Если Объект.РаспределениеПлатежа[0].Документ = Объект.Основание Тогда
			Объект.РаспределениеПлатежа[0].Сумма = Объект.СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	
	РассчитатьСуммуНДС();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	РассчитатьСуммуНДС();
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	РассчитатьСуммуНДС();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДС()
	Объект.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Объект.СуммаДокумента,
	                                             УчитыватьНДС, ,
	                                             УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС));	
КонецПроцедуры

&НаКлиенте
Процедура УказатьВНазначении(Команда)

	ПозицияСуммы = СтрНайти(Объект.НазначениеПлатежа, "Сумма ");
	Если ПозицияСуммы = 0 И ЗначениеЗаполнено(Объект.НазначениеПлатежа) Тогда
		ТекстНазначение = Объект.НазначениеПлатежа;
	Иначе
		ТекстНазначение = СокрЛП(Лев(Объект.НазначениеПлатежа, ПозицияСуммы - 1));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстНазначение) Тогда
		ТекстНазначение = Объект.НазначениеПлатежа;
	КонецЕсли;
	
	ТекстСумма = Строка(Формат(Объект.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
	
	ТекстНДС = "";
	ЧислоСтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	
	Если УчитыватьНДС И ЗначениеЗаполнено(Объект.СтавкаНДС) И ЧислоСтавкаНДС > 0 Тогда
		ТекстНДС = НСтр("ru = 'НДС(%СтавкаНДС%) %СуммаНДС%'");
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СтавкаНДС%", Строка(Объект.СтавкаНДС));
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СуммаНДС%", Строка(Формат(Объект.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")));
	КонецЕсли;
	
	Если УчитыватьНДС Тогда
		ТекстНазначениеПлатежа = НСтр("ru = '%ТекстНазначение% %ТекстСумма% %ЗначениеСтавкиНДС% %ТекстНДС%'");
	Иначе
		ТекстНазначениеПлатежа = НСтр("ru = '%ТекстНазначение% %ТекстСумма%'");
	КонецЕсли;
	
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНазначение%", ТекстНазначение);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстСумма%", "Сумма "+ТекстСумма);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ЗначениеСтавкиНДС%", ?(ЧислоСтавкаНДС > 0, НСтр("ru = 'в т.ч.'"), НСтр("ru = 'Без налога (НДС)'")));
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНДС%", ТекстНДС);
	
	Объект.НазначениеПлатежа = СокрЛП(ТекстНазначениеПлатежа);
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр",         ЭтаФорма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("КодБК",                  Объект.КодБК);
	ПараметрыФормы.Вставить("КодОКАТО",               Объект.КодОКАТО);
	ПараметрыФормы.Вставить("ПоказательДаты",         Объект.ПоказательДаты);
	ПараметрыФормы.Вставить("ПоказательНомера",       Объект.ПоказательНомера);
	ПараметрыФормы.Вставить("ПоказательОснования",    Объект.ПоказательОснования);
	ПараметрыФормы.Вставить("ПоказательПериода",      Объект.ПоказательПериода);
	ПараметрыФормы.Вставить("ПоказательТипа",         Объект.ПоказательТипа);
	ПараметрыФормы.Вставить("СтатусСоставителя",      Объект.СтатусСоставителя);
	//ПараметрыФормы.Вставить("ТекущаяДата",            ТекущаяДата);
	
	Оповещение = Новый ОписаниеОповещения("НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму(
		"ОбщаяФорма.РеквизитыПлатежаВБюджет",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьРеквизитыПлатежаВБюджетНажатиеЗавершение(РеквизитыПлатежаВБюджет, ДополнительныеПараметры) Экспорт
	
	Если РеквизитыПлатежаВБюджет <> Неопределено Тогда	
		Модифицированность = Истина;		
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлатежаВБюджет);		
		УправлениеПоказателямиПлатежаВБюджет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеречислениеВБюджетПриИзмененииНаСервере()

	Если Объект.ПеречислениеВБюджет Тогда
		Если ПустаяСтрока(Объект.КодОКАТО) Тогда
			Объект.КодОКАТО = Объект.Организация.КодПоОКТМО;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеПоказателямиПлатежаВБюджет();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречислениеВБюджетПриИзменении(Элемент)
	ПеречислениеВБюджетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаСотрудникамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = Объект.ЗарплатаСотрудникам.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), 
							ДобавитьМесяц(Объект.ПериодРегистрации, Направление),
							ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));							
	Объект.ПериодРегистрации 		= НачалоМесяца(Объект.ПериодРегистрации);
	ОтображениеПериодаРегистрации 	= Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, ТекущаяДата());
	СтруктураПараметров 	 = Новый Структура("ДатаКалендаря, ЗакрыватьПриВыборе, МножественныйВыбор", ДатаКалендаряПриОткрытии, Истина, Ложь);
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьСписокСтатусов()
	
	СписокВыбора = Элементы.СтатусУтвержденияПлатежа.СписокВыбора;
	Если Не ПравоУтверждения Тогда		
		СписокВыбора.Очистить();
		СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден);
		
		Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
			СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.Утвержден);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоСтатусу()
	ТолькоПросмотрЭлементов = Ложь;
	
	Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда	
		ТолькоПросмотрЭлементов = Истина;
	КонецЕсли;
		
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.Номер);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Дата);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ТипДенежныхСредств);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаПраво);
	ЭлементыТолькоПросмотр.Добавить(Элементы.СтатусУтвержденияПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаОрганизация);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаСуммаДокумента);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаНДС);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаПеречислениеВБюджет);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаУИНОчередность);
	ЭлементыТолькоПросмотр.Добавить(Элементы.НазначениеПлатежа);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Страницы);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаДополнительно);
	
	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
	
	ЭлементыДоступность = Новый Массив;
	ЭлементыДоступность.Добавить(Элементы.УказатьВНазначении);
	
	Для каждого Элемент Из ЭлементыДоступность Цикл
		Элемент.Доступность = Не ТолькоПросмотрЭлементов;
	КонецЦикла;
		
	Если ПравоУтверждения 
		И Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден
		И НЕ СостояниеОплачено Тогда
		Элементы.СтатусУтвержденияПлатежа.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоТипуДС()
	
	ВидимостьНаличные = (Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные); 
	
	ЭлементыНаличные = Новый Массив;
	ЭлементыНаличные.Добавить(Элементы.ВидОперацииРКО);
	ЭлементыНаличные.Добавить(Элементы.Касса);
	
	Для каждого Элемент Из ЭлементыНаличные Цикл
		Элемент.Видимость = ВидимостьНаличные;
	КонецЦикла;

	ЭлементыБезналичные = Новый Массив;
	ЭлементыБезналичные.Добавить(Элементы.ВидОперацииСРС);
	ЭлементыБезналичные.Добавить(Элементы.Счет);
	ЭлементыБезналичные.Добавить(Элементы.СчетКонтрагента);
	ЭлементыБезналичные.Добавить(Элементы.СтавкаНДС);
	ЭлементыБезналичные.Добавить(Элементы.СуммаНДС);
	ЭлементыБезналичные.Добавить(Элементы.НазначениеПлатежа);
	ЭлементыБезналичные.Добавить(Элементы.ПеречислениеВБюджет);
	ЭлементыБезналичные.Добавить(Элементы.НадписьРеквизитыПлатежаВБюджет);
	ЭлементыБезналичные.Добавить(Элементы.ИдентификаторПлатежа);
	ЭлементыБезналичные.Добавить(Элементы.ОчередностьПлатежа);
	ЭлементыБезналичные.Добавить(Элементы.КодВидаДохода);
	ЭлементыБезналичные.Добавить(Элементы.УказатьВНазначении);
	
	Для каждого Элемент Из ЭлементыБезналичные Цикл
		Элемент.Видимость = НЕ ВидимостьНаличные;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоНДС()
	Если Объект.ВидОперацииСРС = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику") Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	Иначе
		УчитыватьНДС = Ложь;
	КонецЕсли;
	Элементы.ГруппаНДС.Видимость = УчитыватьНДС;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоВидуРКО()
	
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Договор.Видимость = Ложь;
	Элементы.ГруппаЗарплатаСотрудникам.Видимость = Ложь;
	Элементы.ОтображениеПериодаРегистрации.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
	Элементы.СуммаДокумента.ТолькоПросмотр = Ложь;
	//Элементы.ГруппаВидНачисленияСотрудника.Видимость = Ложь; //#6576 
	Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Ложь;
	Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Ложь;
	
	//#9708
	Элементы.СтатьяРасходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
									И Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание;
									
	Элементы.СтатьяРасходов.Видимость = Истина;	// #12545
	
	Если Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Истина;
		
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику Тогда
		Элементы.Контрагент.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
			Объект.Контрагент = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам Тогда
		Элементы.ГруппаЗарплатаСотрудникам.Видимость = Истина;
		Элементы.ОтображениеПериодаРегистрации.Видимость = ОтображатьПериодРегистрации;
		Элементы.СуммаДокумента.ТолькоПросмотр = Истина;
		Объект.СуммаДокумента = Объект.ЗарплатаСотрудникам.Итог("Сумма");
		
	ИначеЕсли Объект.ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.Инкассация Тогда
		Элементы.СтатьяРасходов.Видимость = Ложь; // #12545
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоВидуСРС()
	
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКонтрагент.Видимость = Истина;
	Элементы.Контрагент.Видимость = Ложь;
	Элементы.Договор.Видимость = Ложь;
	Элементы.СчетКонтрагента.Видимость = Ложь;	
	Элементы.ГруппаЗарплатаСотрудникам.Видимость = Ложь;
	Элементы.ОтображениеПериодаРегистрации.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПлатежа.Видимость = Ложь;
	Элементы.СуммаДокумента.ТолькоПросмотр = Ложь;
	Элементы.ГруппаПеречислениеВБюджет.Видимость = Ложь;
	//Элементы.ГруппаВидНачисленияСотрудника.Видимость = Ложь; //#6576
	Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Ложь;
	Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Ложь;
	
	//#9708
	Элементы.СтатьяРасходовПоНачислению.Видимость = ПолучитьФункциональнуюОпцию("НекассовыйМетодВеденияУчетаДоходовРасходов") 
									И Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание;
									
	Элементы.СтатьяРасходов.Видимость = Истина; // #12545
	
	Если Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.СчетКонтрагента.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;	
		Элементы.РаспределениеПлатежаГруппаОплатаПоставщику.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВозвратПокупателю Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.СчетКонтрагента.Видимость = Истина;
		Элементы.ГруппаРаспределениеПлатежа.Видимость = Истина;
		Элементы.РаспределениеПлатежаГруппаВозвратПокупателю.Видимость = Истина;
				
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.Договор.Видимость = Истина;
		Элементы.СчетКонтрагента.Видимость = Истина;
		Элементы.ГруппаПеречислениеВБюджет.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ИнкассацияИзБанка Тогда
		Элементы.ГруппаКонтрагент.Видимость = Ложь;
		Элементы.СтатьяРасходов.Видимость = Ложь; // #12545
		
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам Тогда
		Элементы.ГруппаЗарплатаСотрудникам.Видимость = Истина;
		Элементы.ОтображениеПериодаРегистрации.Видимость = ОтображатьПериодРегистрации;
		Если Объект.ЗарплатаСотрудникам.Количество() > 0 Тогда
			Элементы.СуммаДокумента.ТолькоПросмотр = Истина;
			Объект.СуммаДокумента = Объект.ЗарплатаСотрудникам.Итог("Сумма");
		КонецЕсли;	
		//Элементы.Контрагент.Видимость = Истина;           //#13333 закомментировано
		//Элементы.СчетКонтрагента.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотруднику Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.СчетКонтрагента.Видимость = Истина;	
		Элементы.ОтображениеПериодаРегистрации.Видимость = ОтображатьПериодРегистрации;
		//Элементы.ГруппаВидНачисленияСотрудника.Видимость = Истина; //#6576 
	ИначеЕсли Объект.ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику Тогда
		Элементы.Контрагент.Видимость = Истина;
		Элементы.СчетКонтрагента.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
			Объект.Контрагент = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КодВидаДохода.Видимость = ФинансыСервер.ВозможноВзысканиеСПеречисленияФизлицу(Объект.Дата, Объект.ВидОперацииСРС);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПоказателямиПлатежаВБюджет()
	
	Элементы.НадписьРеквизитыПлатежаВБюджет.Видимость = Объект.ПеречислениеВБюджет;
	
	Если Объект.ПеречислениеВБюджет Тогда
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИН'");
		Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru = 'Уникальный идентификатор начисления указывается, если предоставлен получателем (администратором) платежа.'");
	Иначе
		Элементы.ИдентификаторПлатежа.Заголовок = НСтр("ru = 'УИП'");
		Элементы.ИдентификаторПлатежа.Подсказка = НСтр("ru = 'Уникальный идентификатор платежа указывается, если это предусмотрено договором с получателем платежа.'");
	КонецЕсли;
		
	УстановитьНадписьРеквизитовПлатежаВБюджет();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьРеквизитовПлатежаВБюджет() Экспорт
		 
	Если НЕ ПустаяСтрока(СокрЛП(Объект.КодБК)) Тогда
		КБК = Объект.КодБК;
	Иначе
		КБК = НСтр("ru = '<КБК не указан>'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СокрЛП(Объект.КодОКАТО)) Тогда
		КодТерритории = Объект.КодОКАТО;
	Иначе
		КодТерритории = НСтр("ru = '<ОКТМО не указан>'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СокрЛП(Объект.СтатусСоставителя)) Тогда
		СтатусСоставителя = Объект.СтатусСоставителя;
	Иначе
		СтатусСоставителя = НСтр("ru = '<Статус составителя не указан>'");
	КонецЕсли;
	
	ЭтаФорма.НадписьРеквизитыПлатежаВБюджет = КБК + "; "
		+ КодТерритории + "; "
		+ СтатусСоставителя + "; "
		+ Объект.ПоказательОснования + "; "
		+ Объект.ПоказательПериода + "; "
		+ Объект.ПоказательНомера + "; "
		+ Объект.ПоказательДаты + "; ";
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	
	Если Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные И НЕ Объект.ВидОперацииРКО.Пустая() Тогда
		Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперацииРКО, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
		
	ИначеЕсли Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные И НЕ Объект.ВидОперацииСРС.Пустая() Тогда
		Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, Объект.ВидОперацииСРС, Ложь);
		Объект.СтатьяРасходовПоНачислению = Объект.СтатьяРасходов; //#9708
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Распределение_ПодобратьПоОстаткам(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодобратьПоОстаткамЗавершение", ЭтотОбъект);
	ОбщийМодульКлиент.ПроверитьВозможностьПодбораЗаказовВДокументРасхода(Оповещение, ЭтаФорма, Объект.РаспределениеПлатежа);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоОстаткамЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	АдресПлатежейВХранилище = ПоместитьРасшифровкуПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("АдресПлатежейВХранилище", АдресПлатежейВХранилище);
	ПараметрыПодбора.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Валюта", Объект.Валюта);
	ПараметрыПодбора.Вставить("СуммаДокумента", Объект.Сумма);
	ПараметрыПодбора.Вставить("ДатаДокумента", Объект.Дата);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораПоРасчетамСКонтрагентами",	ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРасшифровкуПлатежаВХранилище()
	
	АдресПлатежейВХранилище = ПоместитьВоВременноеХранилище(Объект.РаспределениеПлатежа.Выгрузить(), УникальныйИдентификатор);
	Возврат АдресПлатежейВХранилище;
	
КонецФункции

&НаСервере
Процедура ПолучитьРаспределениеПлатежаИзХранилища(АдресПлатежейВХранилище)
	
	Объект.РаспределениеПлатежа.Загрузить(ПолучитьИзВременногоХранилища(АдресПлатежейВХранилище));
	
КонецПроцедуры

&НаКлиенте
Процедура Распределение_Команда(Команда)
	
	ИмяФормыВыбора = "Документ." + СтрЗаменить(Команда.Имя, "Распределение_", "") + ".ФормаВыбора";
	Если Не Объект.Контрагент.Пустая() Тогда
		ЗначениеОтбора = Новый Структура("Контрагент", Объект.Контрагент);
		ПараметрВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		ПараметрВыбора.Вставить("МножественныйВыбор", Истина);
		ОткрытьФорму(ИмяФормыВыбора, ПараметрВыбора, Элементы.РаспределениеПлатежа);
		// результат обрабатывается в РаспределениеПлатежаОбработкаВыбора как владельца формы выбора
	Иначе
		Состояние("Не указан контрагент");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = Объект.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	//ОбновитьДанные();
	
КонецПроцедуры
